read_libs /cadence/install/FOUNDRY-01/digital/90nm/dig/lib/slow.lib
read_hdl alu_ifelseif.v
elaborate
syn_generic
report_area
syn_map
report_area
syn_opt
report_area 
report_area > alu_ifelseif_area.txt
report_power > alu_ifelseif_power.txt
report_timing > alu_ifelseif_timing.txt
write_hdl > alu_ifelseif_netlist.v
gui_show

