read_libs /cadence/install/FOUNDRY-01/digital/90nm/dig/lib/slow.lib
read_hdl alu_case.v
elaborate
syn_generic
report_area
syn_map
report_area
syn_opt
report_area 
report_area > alu_case_area.txt
report_power > alu_case_power.txt
write_hdl > alu_case_netlist.v
gui_show

